In [1]:
import numpy as np
import pandas as pd
import os
%pwd

'E:\\jupyter-test\\Python\\pandas'

In [4]:
os.getcwd()

'C:\\Users\\lenovo\\Desktop\\jupyter-test\\Python\\pandas'

In [2]:
df = pd.read_csv('./pd_data/learn_pandas.csv')

## 1.汇总函数

In [3]:
df.columns
df.index.tolist()
df.head(3)  # 默认5行
df.shape
df.tail()

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [4]:
#info, describe 分别返回表的信息概况和表中数值列对应的主要统计量 
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   School       200 non-null    object
 1   Grade        200 non-null    object
 2   Name         200 non-null    object
 3   Gender       200 non-null    object
 4   Height       183 non-null    float64
 5   Weight       189 non-null    float64
 6   Transfer     188 non-null    object
 7   Test_Number  200 non-null    int64
 8   Test_Date    200 non-null    object
 9   Time_Record  200 non-null    object
dtypes: float64(2), int64(1), object(7)
memory usage: 15.8+ KB

           Height      Weight  Test_Number
count  183.000000  189.000000   200.000000
mean   163.218033   55.015873     1.645000
std      8.608879   12.824294     0.722207
min    145.400000   34.000000     1.000000
25%    157.150000   46.000000     1.000000
50%    161.900000   51.000000     1.500000
75%    167.500000   65.000000     2.000000
max    193.900000   89.000000     3.000000

## 2.特征统计函数

In [16]:
df.sum()
df.Weight.sum()
df.Weight.mean()
df.Weight.median()
df.Weight.var()
df.Weight.std()
df.Weight.max()
df.Weight.min()

34.0

In [19]:
df[['Weight','Height']].sum() #返回Series

Weight    10398.0
Height    29868.9
dtype: float64

In [20]:
df[['Weight','Height']].sum()['Weight']

10398.0

In [28]:
df.Weight.quantile(0.75) # 分位数
df.Weight.count() # 非缺失值的个数
df.Weight.idxmax() # 最大值索引
df.Weight.idxmin() # 最小值索引

34.0

上面这些所有的函数，由于操作后返回的是标量，所以又称为聚合函数，它们有一个公共参数 axis ，默认为0代表逐列聚合，如果设置为1则表示逐行聚合：

In [30]:
df.sum(axis=1).head() # axis=1 求行的和,默认是求列的和

0    205.9
1    237.5
2    279.9
3     43.0
4    250.0
dtype: float64

In [4]:
df.Height.cumsum(0) # 累计求和

0        158.9
1        325.4
2        514.3
3          NaN
4        688.3
        ...
195    29223.1
196    29384.0
197    29537.9
198    29713.2
199    29868.9
Name: Height, Length: 200, dtype: float64

## 3.排序函数

### sort_values
### sort_index

* sort_values 值排序
* sort_index 索引排序
* 默认参数 ascending=True 为升序

In [33]:
df_test = df[['Grade', 'Name', 'Weight', 'Height']].set_index(['Grade', 'Name'])
df_test.head()

                          Weight  Height
Grade     Name
Freshman  Gaopeng Yang      46.0   158.9
          Changqiang You    70.0   166.5
Senior    Mei Sun           89.0   188.9
Sophomore Xiaojuan Sun      41.0     NaN
          Gaojuan You       74.0   174.0

In [36]:
df_test.sort_values('Weight').head()

                      Weight  Height
Grade     Name
Junior    Xiaoli Chu    34.0   145.4
Sophomore Peng Han      34.0   147.8
Senior    Gaomei Lv     34.0   147.3
Sophomore Qiang Zhou    36.0   150.5
Freshman  Qiang Han     38.0   151.8

In [37]:
df_test.sort_values('Height', ascending=False).head()

                        Weight  Height
Grade    Name
Senior   Xiaoqiang Qin    79.0   193.9
         Mei Sun          89.0   188.9
         Gaoli Zhao       83.0   186.5
Freshman Qiang Han        87.0   185.3
Senior   Qiang Zheng      87.0   183.9

In [39]:
df_test.sort_values(['Weight','Height'], ascending=[True, False]).head()

                       Weight  Height
Grade     Name
Sophomore Peng Han       34.0   147.8
Senior    Gaomei Lv      34.0   147.3
Junior    Xiaoli Chu     34.0   145.4
Sophomore Qiang Zhou     36.0   150.5
Freshman  Yanqiang Xu    38.0   152.4

索引排序的用法和值排序完全一致，只不过元素的值在索引中，此时需要指定索引层的名字或者层号，用参数 level 表示。另外，需要注意的是字符串的排列顺序由字母顺序决定。

In [43]:
# 索引排序
df_test.sort_index(level=['Name']).head()
df_test.sort_index(level=['Grade','Name'],ascending=[True,False]).head()

                        Weight  Height
Grade    Name
Freshman Yanquan Wang     55.0   163.5
         Yanqiang Xu      38.0   152.4
         Yanqiang Feng    51.0   162.3
         Yanpeng Lv       65.0     NaN
         Yanli Zhang      52.0   165.1

## 4.替换函数
### replace和str.replace
### where和mask
### round/abs/clip

1. pandas中的替换函数可以归纳为三类：映射替换、逻辑替换、数值替换
2. 映射替换包含replace方法、str.replace方法、cat.codes方法
3. 改变原数据，需要添加常用参数 inplace=True

* 在 replace 中，可以通过字典构造，或者传入两个列表来进行替换

In [45]:
df.Gender.replace({'Female':0, 'Male':1}).head()

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

In [58]:
df.replace({'Female':0, 'Male':1}).head() ## 全dataframe内替换

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,0,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,1,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,1,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,0,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,1,174.0,74.0,N,2,2019/11/6,0:05:22

In [59]:
df.replace('Female',0).head()

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,0,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,0,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22

In [47]:
df.Gender.replace(['Female','Male'],[0,1]).head()

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

* replace中方向替换，指定 method 参数为 ffill 则为用前面一个最近的未被替换的值进行替换， bfill 则使用后面最近的未被替换的值进行替换。
* regex=True 使用正则替换
* limit 限制填充次数

In [76]:
s = pd.Series(['a', 1, 'b', 2, 1, 1, 'a'])
s.replace([1,2], method='ffill',limit=1) # 第一个参数为被替换的列表,limit限制填充次数

0    a
1    a
2    b
3    b
4    1
5    1
6    a
dtype: object

In [51]:
s.replace([1,2], method='bfill')

0    a
1    b
2    b
3    a
4    a
5    a
6    a
dtype: object

In [55]:
s2 = pd.Series(['a',None,'b',None,None,'a'])
s2.replace(None,method='ffill')

0    a
1    a
2    b
3    b
4    b
5    a
dtype: object

In [80]:
s3 = pd.Series(['a',np.nan,'?','b','a'])
s3.replace(to_replace=r'\?', value='c', regex=True)
s3.replace(np.nan,'d')
s3.replace('a','000')

0    000
1    NaN
2      ?
3      b
4    000
dtype: object

* 逻辑替换包括了 where 和 mask ，这两个函数是完全对称的： where 函数在传入条件为 False 的对应行进行替换，而 mask 在传入条件为 True 的对应行进行替换，当不指定替换值时，替换为缺失值。

In [89]:
df.Weight.where(df.Weight<50).head()

0    46.0
1     NaN
2     NaN
3    41.0
4     NaN
Name: Weight, dtype: float64

In [90]:
df.Weight.mask(df.Weight>=50,1000).head()

0      46.0
1    1000.0
2    1000.0
3      41.0
4    1000.0
Name: Weight, dtype: float64

* 数值替换包含了 round, abs, clip 方法，它们分别表示按照给定精度四舍五入、取绝对值和截断

In [101]:
s5 = pd.Series(['1.34','2.54','4.68','9.01','-1.02','-0.05'],dtype=float)
s5.round(1)

0    1.3
1    2.5
2    4.7
3    9.0
4   -1.0
5   -0.0
dtype: float64

In [102]:
s5.abs()

0    1.34
1    2.54
2    4.68
3    9.01
4    1.02
5    0.05
dtype: float64

In [103]:
s5.clip(2,-1) #lower=2,uper=-1,超过2的都为2，小于-1的都为-1

0    1.34
1    2.00
2    2.00
3    2.00
4   -1.00
5   -0.05
dtype: float64

## 5.唯一值函数
### unique和nunique
### value_counts
### duplicated和drop_duplicates

* unique 和 nunique 可以分别得到其唯一值组成的列表和唯一值的个数
* value_counts 可以得到唯一值和其对应出现的频数
* drop_duplicates 多个列组合的唯一值，参数keep,默认值 first 表示每个组合保留第一次出现的所在行， last 表示保留最后一次出现的所在行， False 表示把所有重复组合所在的行剔除。
* duplicated 和 drop_duplicates 的功能类似，但前者返回了是否为唯一值的布尔列表，其 keep 参数与后者一致。其返回的序列，把重复元素设为 True ，否则为 False 。 drop_duplicates 等价于把 duplicated 为 True 的对应行剔除。

In [109]:
df.Grade.unique()

array(['Freshman', 'Senior', 'Sophomore', 'Junior'], dtype=object)

In [107]:
df.Grade.nunique()

4

In [110]:
df.Grade.value_counts()

Junior       59
Senior       55
Freshman     52
Sophomore    34
Name: Grade, dtype: int64

In [123]:
#df_test.drop_duplicates(['Gender', 'Transfer'])
df_test2 = df[['Gender','Transfer','Grade','School','Name']]
df_test2.head()

   Gender Transfer      Grade                         School            Name
0  Female        N   Freshman  Shanghai Jiao Tong University    Gaopeng Yang
1    Male        N   Freshman              Peking University  Changqiang You
2    Male        N     Senior  Shanghai Jiao Tong University         Mei Sun
3  Female        N  Sophomore               Fudan University    Xiaojuan Sun
4    Male        N  Sophomore               Fudan University     Gaojuan You

In [124]:
df_test2.drop_duplicates(['Gender','Transfer'])

    Gender Transfer     Grade                         School            Name
0   Female        N  Freshman  Shanghai Jiao Tong University    Gaopeng Yang
1     Male        N  Freshman              Peking University  Changqiang You
12  Female      NaN    Senior  Shanghai Jiao Tong University        Peng You
21    Male      NaN    Senior  Shanghai Jiao Tong University   Xiaopeng Shen
36    Male        Y  Freshman              Peking University    Xiaojuan Qin
43  Female        Y  Freshman            Tsinghua University      Gaoli Feng

In [127]:
df_test2.drop_duplicates(['Gender','Transfer'],keep='last')
df_test2.drop_duplicates(['Gender','Transfer'],keep='first')

    Gender Transfer     Grade                         School            Name
0   Female        N  Freshman  Shanghai Jiao Tong University    Gaopeng Yang
1     Male        N  Freshman              Peking University  Changqiang You
12  Female      NaN    Senior  Shanghai Jiao Tong University        Peng You
21    Male      NaN    Senior  Shanghai Jiao Tong University   Xiaopeng Shen
36    Male        Y  Freshman              Peking University    Xiaojuan Qin
43  Female        Y  Freshman            Tsinghua University      Gaoli Feng

In [130]:
df_test2.drop_duplicates(['Gender','Name'],keep=False).head()

   Gender Transfer      Grade                         School            Name
0  Female        N   Freshman  Shanghai Jiao Tong University    Gaopeng Yang
1    Male        N   Freshman              Peking University  Changqiang You
2    Male        N     Senior  Shanghai Jiao Tong University         Mei Sun
4    Male        N  Sophomore               Fudan University     Gaojuan You
5  Female        N   Freshman            Tsinghua University     Xiaoli Qian

In [131]:
df['School'].drop_duplicates() # 在Series上也可以使用

0    Shanghai Jiao Tong University
1                Peking University
3                 Fudan University
5              Tsinghua University
Name: School, dtype: object